## Project 1
1. For your database, you should download and install the appropriate version 
of the Chinook database
 for your RDBMS
, which is available here, under the 
downloads tab: https://chinookdatabase.codeplex.com/
2. Your task is to create a pandas DataFrame that displays Customers’
 Last 
Name and First Name, and each 
customer’s purchased Track names and 
Album Titles.  The information should be sorted by Customer Last
Name 
then Customer First Name

### Based on the above schema provided, the 5 tables that must be joined are the following:

- Customer

- Invoice

- InvoiceLine

- Track

- Album

In [56]:
import sqlalchemy as sqla
import pandas as pd


sql = '''SELECT LastName, FirstName, Name, Title
         FROM Invoice JOIN Customer
         ON Customer.CustomerId = Invoice.CustomerId
         JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         JOIN Track 
         ON InvoiceLine.TrackId = Track.TrackId
         JOIN Album 
         ON Track.AlbumId = Album.AlbumId
         ORDER BY LastName, FirstName'''

db = sqla.create_engine('sqlite:////Users/macbookair/Desktop/CUNY SPS texts:files/fall 2018/is362/Chinook_Sqlite.sqlite')
pd.read_sql(sql, db).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas